## CASE STUDY

# 1. Merge the datasets

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
cust = pd.read_csv('/Users/priyam/Documents/Assignments/DS_Analytics-in-Retail/Customer.csv')              #importing thr datasets
trans = pd.read_csv('/Users/priyam/Documents/Assignments/DS_Analytics-in-Retail/Transactions.csv')
prod_cat = pd.read_csv('/Users/priyam/Documents/Assignments/DS_Analytics-in-Retail/prod_cat_info.csv')

In [3]:
#cust.head()              #understanding the data
#trans.head()
#prod_cat.head()
#cust.describe()
#trans.describe()

#trans.duplicated(subset=['transaction_id']) #some insights

In [4]:
#print (trans.columns)
#print(cust.columns)
#print(prod_cat.columns)

cust.rename(columns = {'customer_Id' : 'cust_id'} , inplace = True)                               #fixing column names to make joins
prod_cat.rename(columns = {'prod_sub_cat_code' : 'prod_subcat_code'} , inplace = True)

#cust.head(2)
#prod_cat.head(2)

In [5]:
final = trans.merge(cust,on = 'cust_id', how = 'left').merge(prod_cat,on = ['prod_cat_code', 'prod_subcat_code'],how = 'left')  #final dataset with all the data,"join"
final.head(2)                  
#final.shape

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type,DOB,Gender,city_code,prod_cat,prod_subcat
0,80712190438,270351,28-02-2014,1,1,-5,-772,405.300,-4265.300,e-Shop,26-09-1981,M,5.0,Clothing,Women
1,29258453508,270384,27-02-2014,5,3,-5,-1497,785.925,-8270.925,e-Shop,11-05-1973,F,8.0,Electronics,Computers

# 2. Check the duplicates if there are any duplicates drop them.

In [6]:
print("total duplicates in final dataset:" ,final.duplicated().sum())

total duplicates in final dataset: 13

In [9]:
final.describe(include = None)
#print(final.shape)
#final.drop_duplicates(keep = 'first', inplace = True) 
#print(final.shape)

,transaction_id,cust_id,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,city_code
count,2.305300e+04,23053.000000,23053.000000,23053.000000,23053.000000,23053.000000,23053.000000,23053.000000,23045.000000
mean,5.007348e+10,271021.746497,6.149091,3.763632,2.432395,636.369713,248.667192,2107.308002,5.482534
std,2.898194e+10,2431.692059,3.726372,1.677016,2.268406,622.363498,187.177773,2507.561264,2.863499
min,3.268991e+06,266783.000000,1.000000,1.000000,-5.000000,-1499.000000,7.350000,-8270.925000,1.000000
25%,2.493864e+10,268935.000000,3.000000,2.000000,1.000000,312.000000,98.280000,762.450000,3.000000
50%,5.009313e+10,270980.000000,5.000000,4.000000,3.000000,710.000000,199.080000,1754.740000,5.000000
75%,7.533000e+10,273114.000000,10.000000,5.000000,4.000000,1109.000000,365.715000,3569.150000,8.000000
max,9.998755e+10,275265.000000,12.000000,6.000000,5.000000,1500.000000,787.500000,8287.500000,10.000000

# 3. Check for the null/missing values.

In [ ]:
print(final.shape)
print(final.isnull().sum())        #checking for null values in dataset

# 4. Prepare summary report for all the columns.

In [ ]:
final['total_amt'].plot(kind = 'hist')

In [ ]:
final['Tax'].plot(kind = 'hist')

In [ ]:
sns.set(style='whitegrid')
sns.barplot(x="prod_cat_code",
                    y="Rate",
                    hue="Gender",
                    data=final)